{"resourceType":"CodeSystem","id":"KBV-CS-Base-Medicine-Doseform-EDQM-German","url":"https://fhir.kbv.de/CodeSystem/KBV_CS_Base_Medicine_Doseform_EDQM_German","version":"1.7.0","name":"KBV_CS_Base_Medicine_Doseform_EDQM_German","title":"medicine-doseform","status":"active","experimental":false,"publisher":"Kassenärztliche Bundesvereinigung (KBV)","contact":[{"telecom":[{"system":"url","value":"https://kbv.de"}]}],"description":"Dieses Codesystem enthält die Codes für deutsche Bezeichner für medicine-doseform.","copyright":"Im folgenden Profil können Codes aus den Codesystemen Snomed, Loinc oder Ucum enthalten sein, die dem folgenden Urheberrecht unterliegen: This material includes SNOMED Clinical Terms® (SNOMED CT®) which is used by permission of SNOMED International. All rights reserved. SNOMED CT®, was originally created by The College of American Pathologists. SNOMED and SNOMED CT are registered trademarks of SNOMED International. Implementers of these artefacts must have the appropriate SNOMED CT Affiliate license. This material contains content from LOINC (http://loinc.org). LOINC is copyright © 1995-2020, Regenstrief Institute, Inc. and the Logical Observation Identifiers Names and Codes (LOINC) Committee and is available at no cost under the license at http://loinc.org/license. LOINC® is a registered United States trademark of Regenstrief Institute, Inc. This product includes all or a portion of the UCUM table, UCUM codes, and UCUM definitions or is derived from it, subject to a license from Regenstrief Institute, Inc. and The UCUM Organization. Your use of the UCUM table, UCUM codes, UCUM definitions also is subject to this license, a copy of which is available at ​http://unitsofmeasure.org. The current complete UCUM table, UCUM Specification are available for download at http://unitsofmeasure.org. The UCUM table and UCUM codes are copyright © 1995-2009, Regenstrief Institute, Inc. and the Unified Codes for Units of Measures (UCUM) Organization. All rights reserved. THE UCUM TABLE (IN ALL FORMATS), UCUM DEFINITIONS, AND SPECIFICATION ARE PROVIDED \"AS IS.\" ANY EXPRESS OR IMPLIED WARRANTIES ARE DISCLAIMED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.","caseSensitive":true,"content":"complete","concept":[{"code":"BrausepulverundPulverfuereineSuspensionzumEinnehmen","display":"Brausepulver und Pulver für eine Suspension zum Einnehmen"},{"code":"WundloesungmitverlaengerterWirkungsdauer","display":"Wundlösung mit verlängerter Wirkungsdauer"},{"code":"Verneblerdispersion","display":"Verneblerdispersion"},{"code":"MagensaftresistentesPulverundLoesungsmittelfuereineSuspensionzumEinnehmen","display":"Magensaftresistentes Pulver und Lösungsmittel für eine Suspension zum Einnehmen"},{"code":"KonzentratzurHerstellungeinerDispersionzurInjektion","display":"Konzentrat zur Herstellung einer Dispersion zur Injektion"},{"code":"BeutelchenzurAnwendunginderMundhoehle","display":"Beutelchen zur Anwendung in der Mundhöhle"},{"code":"KonzentratundLoesungsmittelzurHerstellungeinerInjektionsdispersion","display":"Konzentrat und Lösungsmittel zur Herstellung einer Injektionsdispersion"},{"code":"KonzentratundLoesungsmittelzurHerstellungeinerintravesikalenLoesung","display":"Konzentrat und Lösungsmittel zur Herstellung einer intravesikalen Lösung"},{"code":"PulverzurHerstellungeinerSuspensionzumEinnehmenimBeutel","display":"Pulver zur Herstellung einer Suspension zum Einnehmen im Beutel"},{"code":"VaginalzaepfchenmitverlaengerterWirkungsdauer","display":"Vaginalzäpfchen mit verlängerter Wirkungsdauer"},{"code":"FilmzurAnwendunginderMundhoehle","display":"Film zur Anwendung in der Mundhöhle"},{"code":"BrausepulverundSuspensionzurHerstellungeinerSuspensionzumEinnehmen","display":"Brausepulver und Suspension zur Herstellung einer Suspension zum Einnehmen"},{"code":"KonzentratzurHerstellungeinerEmulsionzurInjektion","display":"Konzentrat zur Herstellung einer Emulsion zur Injektion"},{"code":"KonzentratundLoesungsmittelzurHerstellungeinerEmulsionzurInjektion","display":"Konzentrat und Lösungsmittel zur Herstellung einer Emulsion zur Injektion"},{"code":"FilmueberzogenesGranulat","display":"Filmüberzogenes Granulat"},{"code":"FilmueberzogenesGranulatimEinzeldosisbehaeltnis","display":"Filmüberzogenes Granulat im Einzeldosisbehältnis"},{"code":"BrausegranulatundSuspensionzurHerstellungeinerSuspensionzumEinnehmen","display":"Brausegranulat und Suspension zur Herstellung einer Suspension zum Einnehmen"},{"code":"InjektionInfusion","display":"Injektion/Infusion"}]}